[{
		"title": "Heroku CLI",
      "name": "heroku-cli-demo",
		"description": "The reason that Heroku is loved by developers worldwide? The Heroku CLI. Have a look at this commandline tool that is the envy of all others! And remember, the CLI is cool because anything that is here can be scripted and automated to save your developers time.",
      "setup":"https://docs.google.com/a/salesforce.com/spreadsheets/d/17U3zM0lpXyitJimYsa5dmcLaruIVr3Y1G88Zjb5U_4U/edit?usp=sharing",
      "video":"0B3a8rtxyKB8kd0RwQUE3TGtTR1U",
      "image":"/images/cli.png"
	},{
		"title": "Heroku Dashboard",
      "name": "heroku-dashboard-demo",
		"description": "Come take a tour of the most developer friendly PaaS on the market today. It is hard to understand just how easy it is to manage a complete fleet of production applications unless you have seen it for yourself. Heroku takes the hard work out of it, leaving you to just focus on the features your customers need.",
      "setup":"https://docs.google.com/a/salesforce.com/spreadsheets/d/1EdBJVLut09t_seTgHHyj9ujx4dWhXMhgzUIOEp8MnR8/edit?usp=sharing",
      "video":"some video url",
      "image":"/images/metrics.png"
	},{
		"title": "Heroku Pipelines",
      "name": "heroku-pipelines-demo",
		"description": "Have you ever wished your developers could just focus on building features rather than spend countless hours on the operations to maintain their development pipeline? Take a short tour of the Heroku Pipelines and see how your developers can get back to hassle free, quality controlled code deployments. Built right into the platform!",
      "setup":"https://docs.google.com/a/salesforce.com/spreadsheets/d/1f0bfzHz5rQMgHI7vfg2UV45jnLhjLoWLU30-qgIVM-A/edit?usp=sharing",
      "video":"some video url",
      "image":"/images/pipelines.png"
	},{
		"title": "Heroku Connect",
      "name": "heroku-connect-demo",
		"description": "Do you have Salesforce? Got some open source developers? Heroku Connect is the tool for you! Allow your developers access to your Salesforce data in the way they know and love, direct to the database. Just the thing if you are thinking about how to build a Customer Service in your platform that needs to be faster than the Salesforce API.",
      "setup":"https://docs.google.com/a/salesforce.com/spreadsheets/d/18513Tztn5rfUE4pey5yGNkpiXI94jA1YJtR22oQkkFQ/edit?usp=sharing",
      "video":"some video url",
      "image":"/images/connect.png"
	},{
		"title": "Heroku Enterprise",
      "name": "heroku-enterprise-demo",
		"description": "Heroku have been the choice for startups for 10 years, but now many large scale enterprises are capturing that startup spirit by unleashing their developers on the Heroku Enterprise Platform. In this demo see the Enterprise features that everyone from Toyota to KFC are talking about.",
      "setup":"https://docs.google.com/a/salesforce.com/spreadsheets/d/17MgGLRuISuB2tYTSWggCLNIaxqXM1GxY8BG66Nzolb4/edit?usp=sharing",
      "video":"some video url",
      "image":"/images/enterprise.png"
	},{
		"title": "Heroku Kafka",
      "name": "heroku-kafka-demo",
		"description": "Event driven architectures are powering some of the largest and most powerful applications of web technology today, quite often backed by Apache Kafka (including the Salesforce event bus, Platform Events!). With this demo we see just how quick and easy setting up your own Kafka instance can be. Oh, just want a little bit? Then perhaps the Multi-Tenant Kafka is for you!",
      "setup":"https://docs.google.com/a/salesforce.com/spreadsheets/d/1EfJxUT7iMdC4jah90qdP4JBkYG6P0NyB-YrB__pCQpE/edit?usp=sharing",
      "video":"some video url",
      "image":"/images/kafka.png"
	},{
		"title": "Private Spaces",
      "name": "private-spaces-demo",
		"description": "Over the last 10 years Heroku have bought the worlds leading startup platform to the Enterprise by adding ever more advanced features that allow control over the Heroku Envrionment. Take a tour of Private Spaces and understand why the largest companies in the world are moving like start ups again.",
      "setup":"https://docs.google.com/a/salesforce.com/spreadsheets/d/14TKuAMmxD4IN3b52GULByV7wgl6aPmBXGg-epfZoVI4/edit?usp=sharing",
      "video":"some video url",
      "image":"/images/spaces.png"
	},{
		"title": "Add Ons",
      "name": "heroku-addons-demo",
		"description": "Never speak to a software vendor again! Well, maybe not but at least your developers will be free to choose from over 150 different addon providers. Whether your app needs a place to send its logs, an email sender, a message queue or perhaps you need a Graph database, Heroku Addons have you covered.",
      "setup":"https://docs.google.com/a/salesforce.com/spreadsheets/d/1WkosF-OVzci_okLXitjydNYj44cBeJY1itB8PbmZAqA/edit?usp=sharing",
      "video":"some video url",
      "image":"/images/level-up.png"
	},{
		"title": "Heroku Container Registry",
      "name": "container-registry-demo",
		"description": "Got containers? Heroku Container Registry allows you to bring your Docker containers to the Heroku Platform. See how easy it is to build and deploy your Docker containers on the Heroku platform.",
      "setup":"https://docs.google.com/a/salesforce.com/spreadsheets/d/1zVCEu31sGXAJH9gpiHK6SMLyvpouKIwv0M27WNYfGg4/edit?usp=sharing",
      "video":"some video url",
      "image":"/images/docker.png"
	}
]